sims/SIM_Slosh_20/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

// ************************************************************************* //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    // Momentum
    div(rhoPhi,U)                       Gauss linearUpwind grad(U);
    div(phi,U)                          Gauss linearUpwind grad(U);

    // Volume fraction (VOF)
    div(phi,alpha)                      Gauss vanLeer;
    div(phirb,alpha)                    Gauss interfaceCompression;

    // REQUIRED viscous term (this fixed crash)
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
